[
    {
     "id": "1",
     "title": "Chefs Journal",
     "desc": [
        "Chefs Journal is inspired by my pandemic hobby, when I was creating recipes and shared them on Instagram. I created Chefs Journal as a social media platform for foodies and anyone who loves to cook. Users can create recipes, explore recipes and other user’s work of art, as well as connecting with them.",
        "My goal was to push myself outside my comfort zone and build on the skills I learnt at BrainStation Bootcamp. I built this full stack web app using my skills on frontend and backend. Frontend was built using React, and SCSS for styling. Backend was built using Node and Express along with MySQL database. User authentication is done using Google OAuth and Passport. Deployed via hosting on Digital Ocean."
     ],
     "tech": ["JavaScript", "HTML5","React", "Express", "MySQL","SCSS","OAuth 2.0", "Passport", "Git", "GitHub", "Postman", "Figma","DigitalOcean"],
     "photo_url": "/media/ChefsJournal.png",
     "url": "https://chefsjournal.ca",
     "demo": "https://www.loom.com/embed/246a7c3542e84ed6b1cdb17ba9d84837"
    },
    {
     "id": "2",
     "title": "BrainFlix",
     "desc": [
        "A 3-sprint frontend project to build out a prototype for a new video streaming platform. Users can select videos to be played.",
        "I built this responsive web app using React hooks such as useState, and useEffect. Axios was used to send requests to RESTful APIs. Project has been deployed using Netlify."
     ],
     "tech": ["JavaScript", "React","Figma","REST API", "Postman", "Netlify"],
     "photo_url": "/media/BrainFlix.png",
     "url": "https://brainflix-shaz.netlify.app/"
    },
    {
      "id": "3",
      "title": "Instock",
      "desc": [
         "Team programming project, to deliver an Inventory Management System for a client by turning UX flows into proof-of-concept full stack web application.",
         "Built using React, JavaScript and SCSS on the frontend, Node.js, Express, MySQL, Knex, and Postman on the backend.",
         "Used Git/GitHub, JIRA, and Scrum methodology to manage our collaborative workflow, ensuring that our team is always in sync and delivering the best possible results."
      ],
      "tech": ["JavaScript", "HTML5", "SCSS", "Web API", "DOM", "Postman", "Netlify"],
      "photo_url": "/media/InStock.png",
      "url": "https://github.com/search?q=user%3Askherad+in-stock"
     },
    {
     "id": "4",
     "title": "BandSite",
     "desc": [
        "A vanilla JavaScript website for an up-and-coming band."
     ],
     "tech": ["JavaScript", "HTML5", "SCSS", "Web API", "DOM", "Postman", "Netlify"],
     "photo_url": "/media/BandSite.png",
     "url": "https://bandsite-shaz.netlify.app/"
    }
   ]